w809291634/EPnode_OTA/提交代码/IAP-APP/NB/common-IAP/dev/config.c
/****************************************************************  
*Function:  STM32F103系列内部Flash读写操作  
*Author:    ValerianFan  
*Date:      2014/04/09  
*E-Mail:    fanwenjingnihao@163.com  
*Other:     
****************************************************************/  
  
  
#include "stm32f10x.h"  
#include "stm32f10x_flash.h"                     //flash操作接口文件（在库文件中），必须要包含  
#include "config.h"
#include "contiki-conf.h"
#include "string.h"
#include "stdio.h"
//FLASH起始地址
#define STM32_FLASH_BASE 0x08000000 	//STM32 FLASH的起始地址
#define STM32_FLASH_SIZE 128 	 		//所选STM32的FLASH容量大小(单位为K)

//FLASH 扇区的起始地址
#define ADDR_FLASH_SECTOR_0     ((u32)0x08000000) 	//扇区0起始地址, 16 Kbytes  
#define ADDR_FLASH_SECTOR_1     ((u32)0x08004000) 	//扇区1起始地址, 16 Kbytes  
#define ADDR_FLASH_SECTOR_2     ((u32)0x08008000) 	//扇区2起始地址, 16 Kbytes  
#define ADDR_FLASH_SECTOR_3     ((u32)0x0800C000) 	//扇区3起始地址, 16 Kbytes  
#define ADDR_FLASH_SECTOR_4     ((u32)0x08010000) 	//扇区4起始地址, 64 Kbytes 


nb_config_t  nbConfig = {
  .id = AID,
  .key = AKEY,
  .ip = CONFIG_ZHIYUN_IP,
  .port = CONFIG_ZHIYUN_PORT,
  .mode = 1,
  .nbandFlag = 0,
};

//读取指定地址的半字(16位数据)
//faddr:读地址(此地址必须为2的倍数!!)
//返回值:对应数据.
u16 STMFLASH_ReadHalfWord(u32 faddr)
{
	return *(vu16*)faddr; 
} 
//不检查的写入
//WriteAddr:起始地址
//pBuffer:数据指针
//NumToWrite:半字(16位)数   
void STMFLASH_Write_NoCheck(u32 WriteAddr,u16 *pBuffer,u16 NumToWrite)   
{ 			 		 
	u16 i;
	for(i=0;i<NumToWrite;i++)
	{
		FLASH_ProgramHalfWord(WriteAddr,pBuffer[i]);
	    WriteAddr+=2;//地址增加2.
	}  
} 
//从指定地址开始写入指定长度的数据
//WriteAddr:起始地址(此地址必须为2的倍数!!)
//pBuffer:数据指针
//NumToWrite:半字(16位)数(就是要写入的16位数据的个数.)
#define STM_SECTOR_SIZE 1024 //字节	 
u16 STMFLASH_BUF[STM_SECTOR_SIZE/2];//最多是2K字节
void STMFLASH_Write(u32 WriteAddr,u16 *pBuffer,u16 NumToWrite)	
{
	u32 secpos;	   //扇区地址
	u16 secoff;	   //扇区内偏移地址(16位字计算)
	u16 secremain; //扇区内剩余地址(16位字计算)	   
 	u16 i;    
	u32 offaddr;   //去掉0X08000000后的地址
	if(WriteAddr<STM32_FLASH_BASE||(WriteAddr>=(STM32_FLASH_BASE+1024*STM32_FLASH_SIZE)))return;//非法地址
	FLASH_Unlock();						//解锁
	offaddr=WriteAddr-STM32_FLASH_BASE;		//实际偏移地址.
	secpos=offaddr/STM_SECTOR_SIZE;			//扇区地址  0~127 for STM32F103RBT6
	secoff=(offaddr%STM_SECTOR_SIZE)/2;		//在扇区内的偏移(2个字节为基本单位.)
	secremain=STM_SECTOR_SIZE/2-secoff;		//扇区剩余空间大小   
	if(NumToWrite<=secremain)secremain=NumToWrite;//不大于该扇区范围
	while(1) 
	{	
		STMFLASH_Read(secpos*STM_SECTOR_SIZE,STMFLASH_BUF,STM_SECTOR_SIZE/2);//读出整个扇区的内容
		for(i=0;i<secremain;i++)//校验数据
		{
			if(STMFLASH_BUF[secoff+i]!=0XFFFF)break;//需要擦除  	  
		}
		if(i<secremain)//需要擦除
		{
			FLASH_ErasePage(secpos*STM_SECTOR_SIZE+STM32_FLASH_BASE);//擦除这个扇区
			for(i=0;i<secremain;i++)//复制
			{
				STMFLASH_BUF[i+secoff]=pBuffer[i];	  
			}
			STMFLASH_Write_NoCheck(secpos*STM_SECTOR_SIZE+STM32_FLASH_BASE,STMFLASH_BUF,STM_SECTOR_SIZE/2);//写入整个扇区  
		}else STMFLASH_Write_NoCheck(WriteAddr,pBuffer,secremain);//写已经擦除了的,直接写入扇区剩余区间. 				   
		if(NumToWrite==secremain)break;//写入结束了
		else//写入未结束
		{
			secpos++;				//扇区地址增1
			secoff=0;				//偏移位置为0 	 
		   	pBuffer+=secremain;  	//指针偏移
			WriteAddr+=secremain;	//写地址偏移	   
		   	NumToWrite-=secremain;	//字节(16位)数递减
			if(NumToWrite>(STM_SECTOR_SIZE/2))secremain=STM_SECTOR_SIZE/2;//下一个扇区还是写不完
			else secremain=NumToWrite;//下一个扇区可以写完了
		}	 
	};	
	FLASH_Lock();//上锁
}

//从指定地址开始读出指定长度的数据
//ReadAddr:起始地址
//pBuffer:数据指针
//NumToWrite:半字(16位)数
void STMFLASH_Read(u32 ReadAddr,u16 *pBuffer,u16 NumToRead)   	
{
	u16 i;
	for(i=0;i<NumToRead;i++)
	{
		pBuffer[i]=STMFLASH_ReadHalfWord(ReadAddr);//读取2个字节.
		ReadAddr+=2;//偏移2个字节.	
	}
}  

void config_save_id(char *data)
{
  STMFLASH_Write(ADDR_FLASH_SECTOR_3+200,(u16 *)data,(strlen(data)+1));
}

void config_read_id()
{
  char buf[33];
  char n = 0;
  STMFLASH_Read(ADDR_FLASH_SECTOR_3+200, (u16 *)buf, 16);
  while((buf[n] >= '.') && (buf[n] <= 'z') && (n < 16)){
  nbConfig.id[n] = buf[n];
  n++;
  }
  if(n > 0)
  nbConfig.id[n] = 0;
}



void config_save_key(char *data)
{
  STMFLASH_Write(ADDR_FLASH_SECTOR_3+300,(u16 *)data,(strlen(data)+1));
}

void config_read_key()
{
  char buf[130];
  char n = 0;
  STMFLASH_Read(ADDR_FLASH_SECTOR_3+300, (u16 *)buf, 64);
  while((buf[n] >= '.') && (buf[n] <= 'z') && (n < 64)){
  nbConfig.key[n] = buf[n];
  n++;
  }
  if(n > 0)
  nbConfig.key[n] = 0;
}

void config_save_ip(char *data)
{
  STMFLASH_Write(ADDR_FLASH_SECTOR_3+400,(u16 *)data,(strlen(data)+1));
}

void config_read_ip()
{
  char buf[130];
  char n = 0;
  STMFLASH_Read(ADDR_FLASH_SECTOR_3+400, (u16 *)buf, 64);
  while((buf[n] >= '.') && (buf[n] <= 'z') && (n < 64)){
  nbConfig.ip[n] = buf[n];
  n++;
}
  if(n > 0)
  nbConfig.ip[n] = 0;

}

/*********************************************************************************************
* 名称：config_init(void)
* 功能：配置初始化函数
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
int config_init(void)
{
//  u32 flag = 0;
//  u32 off = (sizeof(nbConfig)+3)&0xfffffffC;
//  
//  STMFLASH_Read(ADDR_FLASH_SECTOR_3+off, (u16*)&flag, 2);
//  if (flag != 0xa4a4a4a4) {
//    //默认不改变
//  } else {
//    STMFLASH_Read(ADDR_FLASH_SECTOR_3, (u16*)&nbConfig, (sizeof(nbConfig)+1)>>1);
//  }
//  return 0;
  
  nb_config_t temp_param;
  STMFLASH_Read(PARAMETER_ADDRESS, (u16*)&temp_param, (sizeof(nb_config_t)+1)>>1);
  if (temp_param.flag != 0xa5a5a5a5) {  //未初始化
    nbConfig.boot_mode = BOOT_APP;
    nbConfig.app_en = APP_OK;
    nbConfig.flag = 0xa5a5a5a5;
    return 0;
  } else {
    nbConfig = temp_param;
    return 1;
  }
}


/*********************************************************************************************
* 名称：
* 功能：
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void config_save(void)
{
//  u32 flag = 0;
//  u32 off = (sizeof(nbConfig)+3)&0xfffffffC;
//  
//  STMFLASH_Write(ADDR_FLASH_SECTOR_3, (u16*)&nbConfig, (sizeof(nbConfig)+1)>>1);
//  
//  STMFLASH_Read(ADDR_FLASH_SECTOR_3+off, (u16*)&flag, 2);
//  if (flag != 0xa4a4a4a4) {
//    flag =  0xa4a4a4a4;
//    STMFLASH_Write(ADDR_FLASH_SECTOR_3+off, (u16*)&flag, 2);
//  } else {
//    
//  }
  nbConfig.flag = 0xa5a5a5a5;
  STMFLASH_Write(PARAMETER_ADDRESS, (u16*)&nbConfig, (sizeof(nbConfig)+1)>>1);
}